clear all;
clc;

%固定参数赋值%
a=0.6;
q=0.3;
c1=0.3;
c2=0.4;
m1=0.03;
m2=0.04;
m3=0.05;
f1=0.3;
f2=0.9;
f3=0.1;
t1=0.5;
t2=0.1;
t3=0.9;
n=100;

%1.质量问题的负面影响对结果的影响 先给参数赋值%
g=0.3;r=0.4;e=0.1;x=0.1;

%参数设置完成，开始带入公式%
b=0:0.1:1;
p1=(1/3)*(2-2*((1-a)*(b+g)-f1*(r+e)+t1*x)+m1+c1);
w1=(1/3)*(1-((1-a)*(b+g)-f1*(r+e)+t1*x)-m1+2*c1);
p2=(1/3)*(2-2*(-f2*(r+e)+t2*x)+m2+c2);
w2=(1/3)*(1-(-f2*(r+e)+t2*x)-m2+2*c2);
p3=(1/2)*(1-((1-q)*(b+g)-f3*(r+e)+t3*x)+m3);
plot(b,p1,b,w1,b,p2,b,w2,b,p3);
hold on;
yline(p2,'-','p2');
yline(w2,'-','w2');
text(b,p1,'p1');
text(b,p3,'p3');
text(b,w1,'w1');
%legend("p1","w1","p2","w2","p3");%
hold off;

%% 
clear all;
clc;

%固定参数赋值%
a=0.6;
q=0.3;
c1=0.3;
c2=0.4;
m1=0.03;
m2=0.04;
m3=0.05;
f1=0.3;
f2=0.9;
f3=0.1;
t1=0.5;
t2=0.1;
t3=0.9;
n=100;

g=0.3;r=0.4;e=0.1;x=0.1;
b=0:0.1:1;

%2.对pi的影响%
s1=(1/9)*n*((1-((1-a)*(b+g)-f1*(r+e)+t1*x)-m1-c1).^2);
i1=(1/9)*n*((1-((1-a)*(b+g)-f1*(r+e)+t1*x)-m1-c1).^2);
s2=(1/9)*n*((1-(-f2*(r+e)+t2*x)-m2-c2).^2);
i2=(1/9)*n*((1-(-f2*(r+e)+t2*x)-m2-c2).^2);
s3=(1/4)*n*((1-((1-q)*(b+g)-f3*(r+e)+t3*x)-m3).^2);
plot(b,s1,b,i1,b,s2,b,i2,b,s3);
hold on;
yline(s2,'-','s2');
text(b,i1,'i1');
yline(i2,'-','i2');
text(b,s1,'s1');
text(b,s3,'s3');
hold off;



%% 
clear all;
clc;

%固定参数赋值%
a=0.6;
q=0.3;
c1=0.3;
c2=0.4;
m1=0.03;
m2=0.04;
m3=0.05;
f1=0.3;
f2=0.9;
f3=0.1;
t1=0.5;
t2=0.1;
t3=0.9;
n=100;

g=0.3;r=0.4;e=0.1;x=0.1;
b=0:0.1:1;


CS1=(1/18)*n*((1-((1-a)*(b+g)-f1*(r+e)+t1*x)-m1-c1).^2);
CS2=(1/18)*n*((1-(-f2*(r+e)+t2*x)-m2-c2).^2);
CS3=(1/8)*n*((1-((1-q)*(b+g)-f3*(r+e)+t3*x)-m3).^2);
plot(b,CS1,b,CS2,b,CS3);
hold on;
yline(CS2,'-','CS2');
text(b,CS1,'CS1');
text(b,CS3,'CS3');
hold off;

%% 
%% 
clear all;
clc;

%固定参数赋值%
a=0.6;
q=0.3;
c1=0.3;
c2=0.4;
m1=0.03;
m2=0.04;
m3=0.05;
f1=0.3;
f2=0.9;
f3=0.1;
t1=0.5;
t2=0.1;
t3=0.9;
n=100;

g=0.3;r=0.4;e=0.1;x=0.1;
b=0:0.1:1;


SW1=(1/18)*5*n*((1-((1-a)*(b+g)-f1*(r+e)+t1*x)-m1-c1).^2);
SW2=(1/18)*5*n*((1-(-f2*(r+e)+t2*x)-m2-c2).^2);
SW3=(1/8)*3*n*((1-((1-q)*(b+g)-f3*(r+e)+t3*x)-m3).^2);
plot(b,SW1,b,SW2,b,SW3);
hold on;
yline(SW2,'-','SW2');
text(b,SW1,'SW1');
text(b,SW3,'SW3');
hold off;
