clear all;
clc;

%固定参数赋值%
a=0.6;
q=0.3;
c1=0.3;
c2=0.4;
m1=0.03;
m2=0.04;
m3=0.05;
f1=0.3;
f2=0.9;
f3=0.1;
t1=0.5;
t2=0.1;
t3=0.9;
n=100;

%1.质量问题的负面影响对结果的影响 先给参数赋值%
b=0.6;g=0.3;e=0.1;x=0.1;

%参数设置完成，开始带入公式%
r=0:0.1:1;
p1=(1/3)*(2-2*((1-a)*(b+g)-f1*(r+e)+t1*x)+m1+c1);
w1=(1/3)*(1-((1-a)*(b+g)-f1*(r+e)+t1*x)-m1+2*c1);
p2=(1/3)*(2-2*(-f2*(r+e)+t2*x)+m2+c2);
w2=(1/3)*(1-(-f2*(r+e)+t2*x)-m2+2*c2);
p3=(1/2)*(1-((1-q)*(b+g)-f3*(r+e)+t3*x)+m3);
plot(r,p1,r,w1,r,p2,r,w2,r,p3);
hold on;
text(r,p1,'p1');
text(r,p3,'p3');
text(r,w1,'w1');
text(r,w2,'w2');
text(r,p2,'p2');
%legend("p1","w1","p2","w2","p3");%
hold off;

%% 
clear all;
clc;

%固定参数赋值%
a=0.6;
q=0.3;
c1=0.3;
c2=0.4;
m1=0.03;
m2=0.04;
m3=0.05;
f1=0.3;
f2=0.9;
f3=0.1;
t1=0.5;
t2=0.1;
t3=0.9;
n=100;

b=0.6;g=0.3;e=0.1;x=0.1;
r=0:0.1:1;

%2.对pi的影响%
s1=(1/9)*n*((1-((1-a)*(b+g)-f1*(r+e)+t1*x)-m1-c1).^2);
i1=(1/9)*n*((1-((1-a)*(b+g)-f1*(r+e)+t1*x)-m1-c1).^2);
s2=(1/9)*n*((1-(-f2*(r+e)+t2*x)-m2-c2).^2);
i2=(1/9)*n*((1-(-f2*(r+e)+t2*x)-m2-c2).^2);
s3=(1/4)*n*((1-((1-q)*(b+g)-f3*(r+e)+t3*x)-m3).^2);
plot(r,s1,r,i1,r,s2,r,i2,r,s3);
hold on;
%yline(s2,'-','s2');%
text(r,s2,'s2');
text(r,i1,'i1');
%yline(i2,'-','i2');%
text(r,i2,'i2');
text(r,s1,'s1');
text(r,s3,'s3');
hold off;



%% 
clear all;
clc;

%固定参数赋值%
a=0.6;
q=0.3;
c1=0.3;
c2=0.4;
m1=0.03;
m2=0.04;
m3=0.05;
f1=0.3;
f2=0.9;
f3=0.1;
t1=0.5;
t2=0.1;
t3=0.9;
n=100;

b=0.6;g=0.3;e=0.1;x=0.1;
r=0:0.1:1;


CS1=(1/18)*n*((1-((1-a)*(b+g)-f1*(r+e)+t1*x)-m1-c1).^2);
CS2=(1/18)*n*((1-(-f2*(r+e)+t2*x)-m2-c2).^2);
CS3=(1/8)*n*((1-((1-q)*(b+g)-f3*(r+e)+t3*x)-m3).^2);
plot(r,CS1,r,CS2,r,CS3);
hold on;
%yline(CS2,'-','CS2');
text(r,CS1,'CS1');
text(r,CS2,'CS2');
text(r,CS3,'CS3');
hold off;


%% 
clear all;
clc;

%固定参数赋值%
a=0.6;
q=0.3;
c1=0.3;
c2=0.4;
m1=0.03;
m2=0.04;
m3=0.05;
f1=0.3;
f2=0.9;
f3=0.1;
t1=0.5;
t2=0.1;
t3=0.9;
n=100;

b=0.6;g=0.3;e=0.1;x=0.1;
r=0:0.1:1;


SW1=(1/18)*5*n*((1-((1-a)*(b+g)-f1*(r+e)+t1*x)-m1-c1).^2);
SW2=(1/18)*5*n*((1-(-f2*(r+e)+t2*x)-m2-c2).^2);
SW3=(1/8)*3*n*((1-((1-q)*(b+g)-f3*(r+e)+t3*x)-m3).^2);
plot(r,SW1,r,SW2,r,SW3);
hold on;
%yline(SW2,'-','SW2');
text(r,SW1,'SW1');
text(r,SW2,'SW2');
text(r,SW3,'SW3');
hold off;
